# GetLabelFor Method (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
LabelUtils..::..GetLabelFor Method
LabelUtils Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetLabelFor(BuiltInCategory) | Gets the user-visible name for a BuiltInCategory. |
| GetLabelFor(BuiltInParameter) | Gets the user-visible name for a BuiltInParameter. |
| GetLabelFor(BuiltInParameterGroup) | **Obsolete.** Gets the user-visible name for a BuiltInParameterGroup. |
| GetLabelFor(BuiltInParameter, LanguageType) | Gets the user-visible name for a BuiltInParameter in a specific LanguageType. |
| GetLabelFor(DuctLossMethodType, Document) | Gets the user-visible name for a DuctLossMethodType. |
| GetLabelFor(gbXMLBuildingType, Document) | Gets the user-visible name for a gbXMLBuildingType. |
| GetLabelFor(PipeFlowState, Document) | Gets the user-visible name for a PipeFlowState. |
| GetLabelFor(PipeLossMethodType, Document) | Gets the user-visible name for a PipeLossMethodType. |

# See Also
LabelUtils Class
LabelUtils Members
Autodesk.Revit.DB Namespace